
// Лёгкие (1–50)

// Введи имя. Если имя пустое — “Пусто”.
// let a = prompt('Введите')
// if(a === ''){
//     console.log('Пусто')
// }
// Введи число. Если оно больше 50 — “Большое”.
// let n = prompt('Введите')
// if(n>50){
//     console.log('Большое')
// }
// Введи число. Если меньше 0 — “Минус”.
// let a = prompt('Введите')
// if(a < 0){
//     console.log('Minus')
// }
// Введи строку. Если длина > 3 — “Ок”.
// let str = prompt('Введите')
// if(str.lenght > 3){
//     console.log('ok')
// }
// Введи строку. Если есть пробел — “Есть пробел”.
// let str = prompt('Введите')
// if(str.includes(' ')){
//     console.log('Есть пробел')
// }
// Введи число. Если чётное — “Чёт”.
// let n = prompt('Введите')
// if(n %2 === 0){
//     console.log('четное')
// }
// Введи число. Если нечётное — “Нечёт”.
// let n = prompt('Введите')
// if(n %3 === 0){
//     console.log('не четное')
// }
// Введи слово. Если начинается с b — “B”.
// let str = prompt('Введите')
// if(str.startsWith('b')){
//     console.log('B')
// }
// Введи строку. Если заканчивается на ? — “Вопрос”.
// let str = prompt('Введите')
// if(str.endsWith('?')){
//     console.log('Вопрос')
// }
// Введи email. Если есть @gmail — “Gmail”.
// let e = prompt('Введите')
// if(e.includes('@gmail')){
//     console.log('Gmail')
// }
// Введи возраст. Если ≥ 60 — “Пенсионер”.
// let a = prompt('Введите')
// if(a>60){
//     console.log('Пенсионер')
// }
// Введи число. Если равно 100 — “Сотка”.
// let a = prompt('Введите')
// if(a === '100'){
//     console.log('Сотка')
// }
// Введи строку. Если вся строка в верхнем регистре — “BIG”.
// let a = prompt('Введите')
// if (a === a.toUpperCase()){
//     console.log('BIG')
// }
// Введи строку. Если содержит цифру — “Есть цифра”.
// let a = prompt('Введите')
// if(a.includes('1')){
//     console.log('Цифра')
// }
// Введи строку. Если длина = 5 — “Пять”.
// let a = prompt('Введите')
// if(a.length === 5){
//     console.log('five')
// }
// Введи слово. Если все буквы маленькие — “lower”.
// let a = prompt('Введите')
// if(a === a.toLowerCase()){
//     console.log('Small')
// }
// Введи символ. Если это * — “Звезда”.
// let a = prompt('Введите')
// if(a === '*'){
//     console.log('star')
// }
// Введи число. Если делится на 10 — “Кратно 10”.
// let a = prompt('Введите')
// if(a %10 === 0){
//     console.log('кратно 5')
// }
// Введи строку. Если есть . — “Точка”.
// let a = prompt('Введите')
// if(a.includes('.')){
//     console.log('есть точка')
// }
// Введи строку. Если первая буква маленькая — “Маленькая”.
// let a = prompt('Введите')
// if(a[0] === a[0].toLowerCase()){
//     console.log('Small')
// }else{
//     console.log('big')
// }
// Введи число. Если больше 1000 — “Очень большое”.
// let a = prompt('Введите')
// if(a>1000){
//     console.log('Very big')
// }
// Введи два числа. Если второе больше — “Второе”.
// let a = prompt('Введите')
// let b = prompt('Введите')
// if(b > a){
//     console.log('2 bigger than 1')
// }
// Введи строку. Если есть js — “JS”.
// let a = prompt('Введите')
// if(a.includes('js')){
//     console.log('JS')
// }
// Введи строку. Если есть css — “CSS”.
// let a = prompt('Введите')
// if(a.includes('css')){
//     console.log('CSS')
// }
// Введи строку. Если есть html — “HTML”.
// let a = prompt('Введите')
// if(a.includes('html')){
//     console.log('HTML')
// }
// Введи число. Если отрицательное — “Минус”.
// let a = prompt('Введите')
// if(a<0){
//     console.log('Минус')
// }
// Введи строку. Если длина < 2 — “Слишком коротко”.
// let a = prompt('Введите')
// if(a.length<2){
//     console.log('коротко')
// }
// Введи слово. Если начинается и заканчивается одной буквой — “Совпало”.
// let a = prompt('Введите')
// if(a[0] === a.slice(-1)){
//     console.log('совпало')
// }
// Введи строку. Если есть ! — “Эмоции”.
// let a = prompt('Введите')
// if(a.includes('!')){
//     console.log('Emotes')
// }
// Введи число. Если равно 7 — “Семь”.
// let a = prompt('Введите')
// if(a === '7'){
//     console.log('seven')
// }
// Введи строку. Если содержит , — “Запятая”.
// let a = prompt('Введите')
// if(a.includes(',')){
//     console.log('запятая')
// }
// Введи число. Если делится на 2 и 3 — “6”.
// let a = prompt('Введите')
// if(a %2 === 0 || a %3=== 0){
//     console.log('6')
// }
// Введи строку. Если есть # — “Хеш”.
// let a = prompt('Введите')
// if(a.includes('#')){
//     console.log('Have #')
// }
// Введи строку. Если длина > 10 — “Длинная”.
// let a = prompt('Введите')
// if(a.length>10){
//     console.log('long')
// }
// Введи число. Если < 5 — “Маленькое”.
// let a = prompt('Введите')
// if(a < 5){
//     console.log('small')
// }
// Введи строку. Если есть @ — “Есть собака”.
// let a = prompt('Введите')
// if(a.includes('@')){
//     console.log('have dog')
// }
// Введи строку. Если начинается с цифры — “Цифра”.
// let a = prompt('Введите')
// if(a.startsWith()){
//     console.log('num')
// }
// Введи строку. Если заканчивается на . — “Точка в конце”.
// let a = prompt('Введите')
// if(a.endsWith('.')){
//     console.log('есть  точка')
// }
// Введи число. Если равно 1 — “Один”.
// let a = prompt('Введите')
// if(a === '1'){
//     console.log('1')
// }
// Введи число. Если равно 2 — “Два”.
// let a = prompt('Введите')
// if(a === '2'){
//     console.log('2')
// }
// Введи число. Если равно 3 — “Три”.
// let a = prompt('Введите')
// if(a === '3'){
//     console.log('3')
// }
// Введи строку. Если длина чётная — “Чётная”.
// let a = prompt('Введите')
// if(a.length %2 === 0){
//     console.log('четное')
// }
// Введи строку. Если длина нечётная — “Нечётная”.
// let a = prompt('Введите')
// if(a.length %2 !== 0){
//     console.log('nochet')
// }
// Введи слово. Если содержит a — “A”.
// let a = prompt('Введите')
// if(a.includes('a')){
//     console.log('have a')
// }
// Введи слово. Если содержит e — “E”.
// let a = prompt('Введите')
// if(a.includes('e')){
//     console.log('have e')
// }
// Введи слово. Если содержит o — “O”.
// let a = prompt('Введите')
// if(a.includes('o')){
//     console.log('have o')
// }
// Введи число. Если больше 500 — “500+”.
// let a = prompt('Vvedite')
// if(a>500){
//     console.log('500+')
// }
// Введи строку. Если есть % — “Процент”.
// let a = prompt('Введите')
// if(a.includes('%')){
//     console.log('have %')
// }
// Введи строку. Если есть $ — “Доллар”.
// let a = prompt('Введите')
// if(a.includes('$')){
//     console.log('have $')
// }
// Введи строку. Если есть : — “Двоеточие”.
// let a = prompt('Введите')
// if(a.includes(':')){
//     console.log('have :')
// }
// 🟡 Средние (51–100)

// Введи пароль. Если длина ≥ 6 — “Ок”.
// let a = prompt('passwprd')
// if(a.length>6){
//     console.log('ok')
// }
// Введи пароль. Если есть цифра — “Есть цифра”.
// let a = prompt('passwprd')
// if(a.includes('1')){
//     console.log('есть цифра')
// }
// Введи строку. Если есть и a, и b — “AB”.
// let a = prompt('Введите')
// if(a.includes('a') && a.includes('b')){
//     console.log('have ab')
// }
// Введи число. Если последняя цифра 0 — “Ноль в конце”.
// let a = prompt('Введите')
// if(a.endsWith('0')){
//     console.log('0 at end')
// }
// Введи число. Если последняя цифра 5 — “Пять в конце”.
// let a = prompt('Введите')
// if(a.endsWith('5')){
//     console.log('5 at end')
// }
// Введи строку. Если начинается с заглавной — “Ок”.
// let a = prompt('Введите')
// if(a[0] === a[0].toUpperCase()){
//     console.log('ok')
// }
// Введи email. Если заканчивается на .com — “COM”.
// let a = prompt('Введите')
// if(a.endsWith('.com')){
//     console.log('end with com')
// }
// Введи число. Если между 20 и 30 — “Диапазон”.
// let a = prompt('Введите')
// if(a>20 && a<30){
//     console.log('in diaposone')
// }
// Введи строку. Если есть 2 пробела — “Три слова”.
// let a = prompt('Введите')
// if(a.includes('  ')){
//     console.log('2 spaces')
// }
// Введи слово. Если длина ≥ 8 — “Длинное слово”.
// let a = prompt('Введите')
// if(a.length>8){
//     console.log('long')
// }
// Введи число. Если делится на 4 — “4”.
// let a = prompt('Введите')
// if(a %4 ===0){
//     console.log('делится на 4')
// }
// Введи строку. Если нет пробелов — “Одно слово”.
// let a = prompt('Введите')
// if(!a.includes(' ')){
//     console.log('one word')
// }
// Введи число. Если квадрат больше 100 — “Большой квадрат”.
// let a = prompt('Введите')
// if(a>100){
//     console.log('bigg')
// }
// Введи строку. Если есть js и нет html — “Только JS”.
// let a = prompt('Введите')
// if(a.includes('js') || !a.includes('html')){
//     console.log('only js')
// }
// Введи число. Если сумма цифр > 5 — “Сумма”.
// let a = prompt('Введите')
// if(a)
// Введи строку. Если больше 3 букв a — “Много A”.
// let a = prompt('Введите')
// if(a.length>3){
//     console.log('Many a')
// }
// Введи строку. Если первая и последняя буква одинаковы — “Одинаковые”.
// let a = prompt('Введите')
// if(a[0] === a.slice(-1)){
//     console.log('both')
// }
// Введи строку. Если содержит 123 — “Есть 123”.
// let a = prompt('Введите')
// if(a.includes('123')){
//     console.log('123')
// }
// Введи строку. Если есть и ! и ? — “Эмоционально”.
// let a = prompt('Введите')
// if(a.includes('!') || a.includes('?')){
//     console.log('emote')
// }
// Введи число. Если трёхзначное — “3 цифры”.
// let a = prompt('Введите')
// if(a.length === 3){
//     console.log('three nums')
// }
// Введи число. Если двухзначное — “2 цифры”.
// let a = prompt('Введите')
// if(a.length === 2){
//     console.log('two nums')
// }
// Введи строку. Если длина = 1 — “Один символ”.
// let a = prompt('Введите')
// if(a.length === 1){
//     console.log('one')
// }
// Введи число. Если делится на 7 — “7”.
// let a = prompt('Введите')
// if(a %7 === 0){
//     console.log('делится на 7')
// }
// Введи строку. Если есть - — “Дефис”.
// let a = prompt('Введите')
// if(a.includes('-')){
//     console.log('defis')
// }
// Введи строку. Если есть _ — “Подчёркивание”.
// let a = prompt('Введите')
// if(a.includes('_')){
//     console.log('_')
// }
// Введи строку. Если есть + — “Плюс”.
// let a = prompt('Введите')
// if(a.includes('+') || a.includes('-')){
//     console.log('defis')
// }
// Введи строку. Если есть / — “Слэш”.
// let a = prompt('Введите')
// if(a.includes('/')){
//     console.log('have /')
// }
// Введи число. Если больше 9999 — “Очень большое”.
// let a = prompt('Введите')
// if(a>9999){
//     console.log('very big')
// }
// Введи строку. Если содержит kg — “Кыргызстан”.
// let a = prompt('Введите')
// if(a.includes('kg')){
//     console.log('Kyrgyzstan')
// }
// Введи строку. Если содержит ru — “Русский”.
// let a = prompt('Введите')
// if(a.includes('ru')){
//     console.log('Russian')
// }
// Введи число. Если отрицательное и чётное — “Минус чётное”.
// let a = prompt('Введите')
// if(a<0 && a %2 === 0){
//     console.log('минус четное')
// }
// Введи число. Если положительное и нечётное — “Плюс нечётное”.
// let a = prompt('Введите')
// if(a>0 && a %2 === 0){
//     console.log('минус четное')
// }

// Введи строку. Если длина > 15 — “Очень длинная”.
// let a = prompt('Введите')
// if(a.length>15){
//     console.log('very long')
// }
// Введи слово. Если начинается с гласной — “Гласная”.

// Введи строку. Если есть три точки ... — “Многоточие”.
// let a = prompt('Введите')
// if(a.includes('...')){
//     console.log('троеточие')
// }
// Введи число. Если оканчивается на 1 — “Один в конце”.
// let a = prompt('Введите')
// if(a.endsWith('1')){
//     console.log('one in end')
// }
// Введи число. Если оканчивается на 2 — “Два в конце”.
// let a = prompt('Введите')
// if(a.endsWith('2')){
//     console.log('two in end')
// }
// Введи строку. Если в верхнем регистре — “UPPER”.
// let a = prompt('Введите')
// if(a === a.toUpperCase()){
//     console.log('UPPER')
// }
// Введи строку. Если в нижнем
// let a = prompt('Введите')
// if(a === a.toLowerCase()){
//     console.log('LOWER')
// }

// let nums = prompt('Введи строку')
// if (nums == +nums) {
//     console.log('цифры');
    
// } else {
//     console.log('буква');
    
// }
// let str = prompt('vedi str')
// if(str[0] === str[0].toUpperCase()){
//     console.log('gdj')
// }else{
//     console.log('loh')
// }